tiborsimon/embedded-tdd-headers/pic/8bit/pic18f4585_tdd.h
#define LVV2                          4439
#define LVDL2                         4440
#define HLVDL3                        4441
#define LVV3                          4442
#define LVDL3                         4443
#define HLVDEN                        4444
#define LVDEN                         4445
#define BGST                          4446
#define IRVST                         4447
#define IVRST                         4448
#define VDIRMAG                       4449
#define OSCCON                        4450
#define SCS0                          4451
#define SCS                           4452
#define SCS1                          4453
#define IOFS                          4454
#define OSTS                          4455
#define IRCF                          4456
#define IRCF0                         4457
#define IRCF1                         4458
#define IRCF2                         4459
#define IDLEN                         4460
#define T0CON                         4461
#define T0PS                          4462
#define T0PS0                         4463
#define T0PS1                         4464
#define T0PS2                         4465
#define PSA                           4466
#define T0PS3                         4467
#define T0SE                          4468
#define T0CS                          4469
#define T08BIT                        4470
#define TMR0ON                        4471
#define STATUS                        4472
#define C                             4473
#define CARRY                         4474
#define DC                            4475
#define ZERO                          4476
#define Z                             4477
#define OV                            4478
#define OVERFLOW                      4479
#define N                             4480
#define NEGATIVE                      4481
#define INTCON3                       4482
#define INT1IF                        4483
#define INT1F                         4484
#define INT2IF                        4485
#define INT2F                         4486
#define INT1E                         4487
#define INT1IE                        4488
#define INT2IE                        4489
#define INT2E                         4490
#define INT1P                         4491
#define INT1IP                        4492
#define INT2IP                        4493
#define INT2P                         4494
#define INTCON2                       4495
#define RBIP                          4496
#define TMR0IP                        4497
#define T0IP                          4498
#define INTEDG2                       4499
#define INTEDG1                       4500
#define INTEDG0                       4501
#define RBPU                          4502
#define NOT_RBPU                      4503
#define nRBPU                         4504
#define INTCON                        4505
#define RBIF                          4506
#define INT0F                         4507
#define INT0IF                        4508
#define T0IF                          4509
#define TMR0IF                        4510
#define RBIE                          4511
#define INT0E                         4512
#define INT0IE                        4513
#define T0IE                          4514
#define TMR0IE                        4515
#define PEIE                          4516
#define PEIE_GIEL                     4517
#define GIEL                          4518
#define GIE_GIEH                      4519
#define GIE                           4520
#define GIEH                          4521
#define STKPTR0                       4522
#define STKPTR                        4523
#define STKPTR1                       4524
#define STKPTR2                       4525
#define STKPTR3                       4526
#define STKPTR4                       4527
#define STKUNF                        4528
#define STKOVF                        4529
#define STKFUL                        4530

#endif // _PIC18F4585_H_
